## Staging: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                      |
|----------|-----------------------------------------------|
| update   | `aws_lambda_function.archiver`                |
|          | `aws_lambda_function.reliability`             |
| recreate | `aws_lambda_layer_version.archiver_nodejs`    |
|          | `aws_lambda_layer_version.reliability_nodejs` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.archiver will be updated in-place
  ~ resource "aws_lambda_function" "archiver" {
        id                             = "Archiver"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_lib_packages:1",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:13",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:105",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:124",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.archiver_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "archiver_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:13" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-06-12T12:23:13.059+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:13" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "0iu7Y6ZEpuIAEHEjbIv/z6INYO7XHHhYB4FiprtA0v0=" -> "PEvrT4pERtBjnIdAc8h2OIruqD+kj/lvL+VIOrG3cac=" # forces replacement
      ~ source_code_size            = 4927315 -> (known after apply)
      ~ version                     = "13" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:124" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-06-12T12:23:30.156+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:124" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "+W7nAZ5nEmXLTlqC97rhsAY7f2xh5LiEZ1dqWvTDvUk=" -> "m/V++ggjneBmJYlLNWdSznhPaWd1a9QWZsS7l0dTn6U=" # forces replacement
      ~ source_code_size            = 6372244 -> (known after apply)
      ~ version                     = "124" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 17 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
